// Задача1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

/*
Console.WriteLine("Введите первое число");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число");
int numberB = Convert.ToInt32(Console.ReadLine());

if(numberA > numberB)
{
    Console.WriteLine("Наибольшее число "+ numberA);
}
else
{
    Console.WriteLine("Наибольшее число "+ numberB);
}
*/

// Задача2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел


