// Задача1: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*
Console.WriteLine("enter the number");
int num = Convert.ToInt32(Console.ReadLine());

if(num < 0) num = num * -1;

int coupNum = 0;
int temp = num;

while(temp > 0)
{
    coupNum = coupNum * 10 + temp % 10;
    temp = temp / 10;
}
if(num > 0)
{
    if(num == coupNum)
    {
    Console.WriteLine("palindrome");
    }
    else
    {
    Console.WriteLine("not a palindrome");
    }
}
*/
